# main.py
from valutatrade_hub.cli.interface import main as cli_main

def print_banner():
    banner = r"""
\033[96m██╗   ██╗ █████╗ ██╗     ██╗   ██╗████████╗ █████╗ ████████╗██████╗ ██████╗ ███████╗
██║   ██║██╔══██╗██║     ██║   ██║╚══██╔══╝██╔══██╗╚══██╔══╝██╔══██╗██╔══██╗██╔════╝
██║   ██║███████║██║     ██║   ██║   ██║   ███████║   ██║   ██████╔╝██████╔╝█████╗  
██║   ██║██╔══██║██║     ██║   ██║   ██║   ██╔══██║   ██║   ██╔══██╗██╔═══╝ ██╔══╝  
╚██████╔╝██║  ██║███████╗╚██████╔╝   ██║   ██║  ██║   ██║   ██║  ██║██║     ███████╗
 ╚═════╝ ╚═╝  ╚═╝╚══════╝ ╚═════╝    ╚═╝   ╚═╝  ╚═╝   ╚═╝   ╚═╝  ╚═╝╚═╝     ╚══════╝\033[0m
    """
    version = "\033[92mValutaTrade Hub v1.0.0\033[0m"
    separator = "\033[90m" + "=" * 80 + "\033[0m"
    print(separator)
    print(banner)
    print(f"{version.center(80)}")
    print(separator)
    print("💱 CLI для управления валютным портфелем.\n")

def main():
    print_banner()
    cli_main()

if __name__ == "__main__":
    main()




